commits/Catalogs/Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Лиды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Источник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопалВСтатус</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

commits/HTTPServices/CRM/Ext/Module.bsl
&НаСервере
Функция LeadsПолучитьЛиды(Запрос)
 Ответ = Новый HTTPСервисОтвет(200); 
  
 Результат = Новый Структура; 
 Результат.Вставить("success", Истина); 
 Результат.Вставить("data", Новый Массив); 
  
  
 ЗапросЛиды = новый Запрос("ВЫБРАТЬ
|    Лиды.Ссылка КАК Ссылка,
|    Лиды.Наименование КАК Наименование,
|    Лиды.Имя КАК Имя,
|    Лиды.Фамилия КАК Фамилия,
|    Лиды.Статус КАК Статус
|ИЗ
|    Справочник.Лиды КАК Лиды
|ГДЕ
|    НЕ Лиды.ПометкаУдаления
|    И Лиды.ЭтоГруппа = ЛОЖЬ"); 
 
Результат = ЗапросЛиды.Выполнить();
Выборка = ЗапросЛиды.Выбрать(); 
  
Лиды = новый Массив; 
 Пока Выборка.Следующий() Цикл 
  Лид = новый Структура; 
  Лид.Вставить("name", Выборка.Имя); 
  Лид.Вставить("surname", Выборка.Фамилия); 
  Лид.Вставить("status", Выборка.Статус); 
  Лиды.Добавить(Лид); 
 КонецЦикла; 
  
 Результат.data = Лиды; 
  
  
 Ответ.УстановитьТелоИзСтроки(СериализоватьОбъектВJSON(Результат)); 
    Ответ.УстановитьЗаголовок("Content-Type", "application/json; charset=utf-8"); 
  
  
  
  
 Возврат Ответ;
КонецФункции


Функция СериализоватьОбъектВJSON(Объект) Экспорт 
 
    ЗаписьJSON = Новый ЗаписьJSON; 
    ЗаписьJSON.УстановитьСтроку(); 
    ЗаписьJSON.ЗаписатьJSON(Объект); 
    Возврат ЗаписьJSON.Закрыть(); 
 
КонецФункции


&НаСервере
Процедура УстановкаРежима()
УстановитьПривилегированныйРежим(Истина);
КонецПроцедуры
